package by.zayats.AdditionalLessons;

public class TwoDimArray {
    public static void main(String[] args) {


        // Создайте двумерный массив целых чисел и целое число Х, все значения, отличные от Х,заменяет на значение О (ноль).

//        int x = 5;
//        int[][] mas = {{1, 2, 4, 5, 7, 5},
//                {4, 5, 6, 7, 3, 5}};
//
//        for (int i = 0; i < mas.length; i++) {
//            for (int j = 0; j < mas[i].length; j++) {
//                if (mas[i][j] != x) {
//                    mas[i][j] = 0;
//                }
//                System.out.print(mas[i][j] + " ");
//            }
//            System.out.println();
//        }


        //Создайте двумерный массив целых чисел и посчитайте сумму массива (сумму всех значений в массиве).

//        int sum = 0;
//        int[][] mas = {{45, 12, 44, 55}, {22, 11, 33, 66}, {34, 12, 4, 67}};
//        for (int i = 0; i < mas.length; i++) {
//            for (int j = 0; j < mas[i].length; j++) {
//                sum += mas[i][j];
//            }
//        }
//
//        //System.out.println(sum);


        //Создайте двумерный массив целых чисел и целое число К, указывающее на номер строки.
        //1) Программа считает сумму строки К (сумму всех значений в строке номер К) и выводит на экран.
        //2) Выводит на экран сумму каждой строки двумерного массива.

//        int k = 2;
//        int sumK = 0;
//
//        int[][] mas = {{2, 11, 4, 15},
//                {88, 100, 3, 10},
//                {1, 5, 66, 7},
//                {13, 5, 6, 89}};
//
//
//        int[] sum = new int[mas.length];
//
//
//        for (int i = 0; i < mas[k].length; i++) {
//            for (int j = 0; j < mas[i].length; j++) {
//                sumK += mas[k][j];
//            }
//            break;
//
//        }
//
//        System.out.println("Сумма строки К = " + sumK);
//
//        for (int i = 0; i < mas.length; i++) {
//            for (int j = 0; j < mas[i].length; j++) {
//                sum[i] += mas[i][j];
//
//            }
//            System.out.println(sum[i]);
//        }






        //Создайте двумерный массив целых чисел и посчитайте сумму всех элементов на границах массива
        // (первая и последняя строка, первый и последний столбец).






    }
}
