package by.zayats.StacAndHeap;
//Stack - абстрактный тип данных, представляющий собой список элементов. Работает по системе LIFO (последний пришел, первый ушел).
// Он заполняется и освобождается по мере вызова и завершения новых методов. Переменные в Stack существуют до тех пор пока выполняется
// метод в котором они были созданы. FIFO - Первым пришёл — первым ушёл.
//Heap (куча) - используется для динамического выделения памяти для объектов классов JRE во время выполнения. Новые объекты всегда создаются в куче,
// а ссылки на них хранятся в Stack. Эти объекты имеют глобальный доступ и могут быть полученны из любогоместа программы.
//Область памяти заполняется, JAVA бросает ошибку out of memory error. Доступ медленней чем к Stack.
public class Main {
    public static void main(String[] args) {

    }
}
